### Introduction To Pandas Module
Here, we are learning data analysis. Pandas is a software library written for the Python programming language that helps with data manipulation and analysis. It offers various data structures which help in the manipulation of data. <br>
One of the data structures used is DataFrame.<br>
DataFrame is used as a way to store data in a rectangular grid.<br>
Similar to how data is stored in Microsoft Excel.
### Installation
We can easily install this library using the terminal. Follow the steps given below to install Pandas:<br>
Step 1: Go to the Windows PowerShell.<br>
Step 2: We can install pandas with the help of pip easily. Head over to the directory where you want to install the pandas and fire the below command:<br>
__pip install pandas__<br>
This is very simple to install.

In [1]:
# !pip install pandas

### Other way to install
If the above steps do not work for you, here is another way to install:<br>
Step 1: Go to your browser. Search for __python unofficial binaries__, or click <br>
https://www.lfd.uci.edu/~gohlke/pythonlibs/<br> 
and you will be redirected to the binary page.<br>
Step 2: To download the library, search for pandas â€“ Ctrl + F will help you. Download pandas library based on your python version. <br>
Step 3: After the installation, head over to the directory where you've downloaded the pandas. <br>
Step 4: Right-click to open Windows PowerShell. Pip can help us with the installation. Just go to that location in your terminal and run the following command: <br>
__pip install pandas__ <br>
Complete this command by the TAB button so that the location of your folder is mentioned.

### import pandas
Once Pandas is installed, import it in your applications by adding the import keyword:<br>
__import pandas as pd__<br>
Now Pandas is imported and ready to use.

In [2]:
import pandas

In [6]:
import pandas as pd

# Your updated data with GPA
data = {
    'Name': ["Abdul Haseeb", "Haseeb khan", "Muhammad jan", "Haseeb", "Ali Khan"],
    'Marks': [80, 72, 77, 65, 15],
    'Class': ["4st Year", "2nd Year", "1st Year", "3rd Year", "2nd Year"],
    'GPA': [3.7, 3.2, 3.5, 2.8, 1.0]
}

# Create and save dataset.csv
df = pd.DataFrame(data)
df.to_csv('dataset.csv', index=False)

# Read the dataset
classData = pd.read_csv('dataset.csv')
print(classData)

           Name  Marks     Class  GPA
0  Abdul Haseeb     80  4st Year  3.7
1   Haseeb khan     72  2nd Year  3.2
2  Muhammad jan     77  1st Year  3.5
3        Haseeb     65  3rd Year  2.8
4      Ali Khan     15  2nd Year  1.0

In [9]:
dict1 = {
    'Name': ["Abdul Haseeb", "Haseeb khan", "Muhammad jan", "Haseeb","Ali Khan"],
    'Marks': [80, 72, 77, 65, 15],
    'Class':["4st Year", "2nd Year", "1st Year", "3rd Year", "2nd Year"]
}

In [11]:
import pandas as pd

# Now use pd to create the DataFrame
df = pd.DataFrame(dict1)

In [15]:
dict1 = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35]
}
df = pd.DataFrame(dict1)
print(df)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [16]:
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

### Pandas as pd
Pandas is usually imported under the pd alias.
#### alias: 
In Python alias are an alternate name for referring to the same thing.<br>
Create an alias with the as keyword while importing:<br>
__import pandas as pd__<br>
Now the Pandas package can be referred to as pd instead of pandas.

In [17]:
import pandas as pd

In [18]:
df = pd.DataFrame(dict1)

In [19]:
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

### Checking Pandas Version
The version string is stored under __version__ attribute.

In [20]:
pd.__version__

'1.1.5'

## Import to CSV

In [21]:
df.to_csv('pythonMonday.csv')

## Remove Index

In [22]:
df.to_csv('pythonMondayRemoveIndex.csv', index=False)

## Show some rows from the Start

In [23]:
df.head()

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [24]:
df.head()

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [25]:
df.tail(3)

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [26]:
df.tail()

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [27]:
df.describe()

        Age
count   3.0
mean   30.0
std     5.0
min    25.0
25%    27.5
50%    30.0
75%    32.5
max    35.0

In [28]:
classData= pd.read_csv("dataset.csv")

In [29]:
classData

           Name  Marks     Class  GPA
0  Abdul Haseeb     80  4st Year  3.7
1   Haseeb khan     72  2nd Year  3.2
2  Muhammad jan     77  1st Year  3.5
3        Haseeb     65  3rd Year  2.8
4      Ali Khan     15  2nd Year  1.0

In [30]:
classData.drop(0, axis=0)

           Name  Marks     Class  GPA
1   Haseeb khan     72  2nd Year  3.2
2  Muhammad jan     77  1st Year  3.5
3        Haseeb     65  3rd Year  2.8
4      Ali Khan     15  2nd Year  1.0

In [31]:
classData

           Name  Marks     Class  GPA
0  Abdul Haseeb     80  4st Year  3.7
1   Haseeb khan     72  2nd Year  3.2
2  Muhammad jan     77  1st Year  3.5
3        Haseeb     65  3rd Year  2.8
4      Ali Khan     15  2nd Year  1.0

In [32]:
classData['GPA']

0    3.7
1    3.2
2    3.5
3    2.8
4    1.0
Name: GPA, dtype: float64

In [33]:
classData['Class']

0    4st Year
1    2nd Year
2    1st Year
3    3rd Year
4    2nd Year
Name: Class, dtype: object

In [34]:
classData['Name']

0    Abdul Haseeb
1     Haseeb khan
2    Muhammad jan
3          Haseeb
4        Ali Khan
Name: Name, dtype: object

In [35]:
classData['Name']

0    Abdul Haseeb
1     Haseeb khan
2    Muhammad jan
3          Haseeb
4        Ali Khan
Name: Name, dtype: object

In [36]:
type(classData['Name'])

pandas.core.series.Series

In [37]:
classData['GPA']

0    3.7
1    3.2
2    3.5
3    2.8
4    1.0
Name: GPA, dtype: float64

In [38]:
classData['GPA'][0]

3.7

In [39]:
classData['GPA'][0]=90

C:\Users\Amazon Hub\anaconda3\envs\haseeb\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [40]:
classData

           Name  Marks     Class   GPA
0  Abdul Haseeb     80  4st Year  90.0
1   Haseeb khan     72  2nd Year   3.2
2  Muhammad jan     77  1st Year   3.5
3        Haseeb     65  3rd Year   2.8
4      Ali Khan     15  2nd Year   1.0

In [41]:
classData['GPA'][4]

1.0

In [42]:
classData['GPA'][4]=5

C:\Users\Amazon Hub\anaconda3\envs\haseeb\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [43]:
classData["Class"][4]="2nd Year"

C:\Users\Amazon Hub\anaconda3\envs\haseeb\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [44]:
classData

           Name  Marks     Class   GPA
0  Abdul Haseeb     80  4st Year  90.0
1   Haseeb khan     72  2nd Year   3.2
2  Muhammad jan     77  1st Year   3.5
3        Haseeb     65  3rd Year   2.8
4      Ali Khan     15  2nd Year   5.0

In [45]:
classData["Name"][4]

'Ali Khan'

In [46]:
classData

           Name  Marks     Class   GPA
0  Abdul Haseeb     80  4st Year  90.0
1   Haseeb khan     72  2nd Year   3.2
2  Muhammad jan     77  1st Year   3.5
3        Haseeb     65  3rd Year   2.8
4      Ali Khan     15  2nd Year   5.0

In [47]:
classData.to_csv('pythonMondayNew.csv')

In [48]:
classData.to_csv('pythonMondayNewRemoveIndex.csv', index=False)

## Create Labels
With the index argument, you can name your own labels.

In [49]:
classData.index = ["First","Second", "Third", "Fourth", "Fifth"]

In [50]:
classData

                Name  Marks     Class   GPA
First   Abdul Haseeb     80  4st Year  90.0
Second   Haseeb khan     72  2nd Year   3.2
Third   Muhammad jan     77  1st Year   3.5
Fourth        Haseeb     65  3rd Year   2.8
Fifth       Ali Khan     15  2nd Year   5.0

In [51]:
classData["Name"]["Fifth"]

'Ali Khan'

## Pandas 
Pandas is an open source data analysis library written in Python.<br>
It uses the power and speed of numpy to make data analysis and preprocessing easy for data scientists.<br>
__Pandas__ is used to analyze data.<br>
Python data analysis using pandas is a great start to Exploratory Data Analysis (EDA) for a data scientist.

## Pandas Data Structure
Panda has two types of Data Structure:<br> 
    a) Series<br>
    b) Dataframe
### Series
It is a one dimentional array with indexes. It stores a single column or row of data in a Dataframe.<br>
It is a one dimensional array capable of holding any type of data.
### Dataframe
It is a tabular spreadsheet like structure representing rows each of which contains one or more columns.<br>
It is a multi dimensional array capable of holding any type of data.<br>
__Series__ is like a column, a __DataFrame__ is the whole table.

In [52]:
classData['GPA']

First     90.0
Second     3.2
Third      3.5
Fourth     2.8
Fifth      5.0
Name: GPA, dtype: float64

In [53]:
 type(classData['GPA'])

pandas.core.series.Series

In [54]:
classData

                Name  Marks     Class   GPA
First   Abdul Haseeb     80  4st Year  90.0
Second   Haseeb khan     72  2nd Year   3.2
Third   Muhammad jan     77  1st Year   3.5
Fourth        Haseeb     65  3rd Year   2.8
Fifth       Ali Khan     15  2nd Year   5.0

In [55]:
type(classData)

pandas.core.frame.DataFrame

In [56]:
import numpy as np

In [57]:
series1= pd.Series(np.random.rand())

In [58]:
series1

0    0.09015
dtype: float64

In [59]:
series1= pd.Series(np.random.rand(30))

In [60]:
series1

0     0.258912
1     0.535136
2     0.141243
3     0.997373
4     0.832065
5     0.151093
6     0.920187
7     0.550152
8     0.404637
9     0.421093
10    0.260035
11    0.650084
12    0.844445
13    0.195705
14    0.313470
15    0.556210
16    0.353231
17    0.161544
18    0.731333
19    0.383680
20    0.050750
21    0.163065
22    0.170990
23    0.825563
24    0.943724
25    0.582393
26    0.857585
27    0.979972
28    0.369107
29    0.964305
dtype: float64

In [61]:
type(series1)

pandas.core.series.Series

In [62]:
newDf = pd.DataFrame(np.random.rand(330,5))
# newDf = pd.DataFrame(np.random.rand(330,5), index=np.arange(330))

In [63]:
type(newDf)

pandas.core.frame.DataFrame

In [64]:
newDf

            0         1         2         3         4
0    0.873197  0.584004  0.641638  0.590761  0.827202
1    0.219020  0.279671  0.315153  0.537852  0.522993
2    0.038616  0.600151  0.071985  0.969800  0.648097
3    0.218335  0.516788  0.341376  0.654191  0.171033
4    0.077133  0.465228  0.609761  0.777708  0.218406
..        ...       ...       ...       ...       ...
325  0.340830  0.045743  0.601999  0.280884  0.807816
326  0.988932  0.159610  0.837567  0.396409  0.314547
327  0.740892  0.988692  0.590287  0.611523  0.524868
328  0.406848  0.559085  0.173811  0.790897  0.588132
329  0.977689  0.608806  0.418457  0.641351  0.643052

[330 rows x 5 columns]

In [65]:
newDf.head(2)

          0         1         2         3         4
0  0.873197  0.584004  0.641638  0.590761  0.827202
1  0.219020  0.279671  0.315153  0.537852  0.522993

In [66]:
newDf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [67]:
newDf.tail(2)

            0         1         2         3         4
328  0.406848  0.559085  0.173811  0.790897  0.588132
329  0.977689  0.608806  0.418457  0.641351  0.643052

In [68]:
newDf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 330 entries, 0 to 329
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       330 non-null    float64
 1   1       330 non-null    float64
 2   2       330 non-null    float64
 3   3       330 non-null    float64
 4   4       330 non-null    float64
dtypes: float64(5)
memory usage: 13.0 KB

In [69]:
newDf.describe()

                0           1           2           3           4
count  330.000000  330.000000  330.000000  330.000000  330.000000
mean     0.505555    0.494835    0.483376    0.528410    0.494099
std      0.289762    0.287491    0.292573    0.296666    0.293867
min      0.000432    0.000448    0.002080    0.002101    0.006177
25%      0.253712    0.257596    0.228701    0.278102    0.241014
50%      0.492754    0.498183    0.486885    0.538141    0.513977
75%      0.763013    0.743312    0.717139    0.793903    0.737775
max      0.997462    0.993780    0.994781    0.996969    0.998643

In [70]:
newDf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [71]:
newDf[0][0]= "Maaz Khan"

In [72]:
newDf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [73]:
newDf

             0         1         2         3         4
0    Maaz Khan  0.584004  0.641638  0.590761  0.827202
1      0.21902  0.279671  0.315153  0.537852  0.522993
2    0.0386159  0.600151  0.071985  0.969800  0.648097
3     0.218335  0.516788  0.341376  0.654191  0.171033
4    0.0771333  0.465228  0.609761  0.777708  0.218406
..         ...       ...       ...       ...       ...
325    0.34083  0.045743  0.601999  0.280884  0.807816
326   0.988932  0.159610  0.837567  0.396409  0.314547
327   0.740892  0.988692  0.590287  0.611523  0.524868
328   0.406848  0.559085  0.173811  0.790897  0.588132
329   0.977689  0.608806  0.418457  0.641351  0.643052

[330 rows x 5 columns]

In [74]:
newDf.index

RangeIndex(start=0, stop=330, step=1)

In [75]:
newDf.columns

RangeIndex(start=0, stop=5, step=1)

In [76]:
newDf.to_numpy()

array([['Maaz Khan', 0.5840042692072244, 0.6416377555064622,
        0.5907608964938337, 0.8272023875257263],
       [0.21901996818307434, 0.27967068623875346, 0.3151530001802182,
        0.5378520798658906, 0.5229926136809258],
       [0.03861585735671358, 0.6001511927131974, 0.07198457055721241,
        0.9697999492633512, 0.6480972869474569],
       ...,
       [0.7408917557557282, 0.9886916969389133, 0.5902871082249067,
        0.6115231713732175, 0.5248683108056472],
       [0.40684821303341534, 0.559084774552147, 0.17381131191174048,
        0.7908970622003049, 0.5881320304994729],
       [0.9776894835923747, 0.6088056225467844, 0.41845680424787046,
        0.6413506767918662, 0.6430523673330257]], dtype=object)

In [77]:
newDf[0][0]=0.30

C:\Users\Amazon Hub\anaconda3\envs\haseeb\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [78]:
newDf.head()

           0         1         2         3         4
0        0.3  0.584004  0.641638  0.590761  0.827202
1    0.21902  0.279671  0.315153  0.537852  0.522993
2  0.0386159  0.600151  0.071985  0.969800  0.648097
3   0.218335  0.516788  0.341376  0.654191  0.171033
4  0.0771333  0.465228  0.609761  0.777708  0.218406

In [79]:
newDf.T

,0,1,2,3,4,5,6,7,8,9,...,320,321,322,323,324,325,326,327,328,329
0,0.3,0.21902,0.0386159,0.218335,0.0771333,0.437717,0.137788,0.511533,0.832719,0.661249,...,0.329082,0.626747,0.679368,0.87579,0.237231,0.34083,0.988932,0.740892,0.406848,0.977689
1,0.584004,0.279671,0.600151,0.516788,0.465228,0.824672,0.923394,0.561414,0.543111,0.965397,...,0.458059,0.865529,0.431998,0.549338,0.38056,0.0457427,0.15961,0.988692,0.559085,0.608806
2,0.641638,0.315153,0.0719846,0.341376,0.609761,0.476334,0.888916,0.641198,0.982285,0.592284,...,0.328394,0.607033,0.786861,0.359512,0.110929,0.601999,0.837567,0.590287,0.173811,0.418457
3,0.590761,0.537852,0.9698,0.654191,0.777708,0.851669,0.182304,0.695542,0.0309699,0.448902,...,0.903636,0.541953,0.0652932,0.472838,0.698138,0.280884,0.396409,0.611523,0.790897,0.641351
4,0.827202,0.522993,0.648097,0.171033,0.218406,0.474287,0.777872,0.262228,0.660887,0.199469,...,0.123326,0.63955,0.88768,0.745381,0.0844789,0.807816,0.314547,0.524868,0.588132,0.643052

In [80]:
newDf.sort_index(axis=0)

             0         1         2         3         4
0          0.3  0.584004  0.641638  0.590761  0.827202
1      0.21902  0.279671  0.315153  0.537852  0.522993
2    0.0386159  0.600151  0.071985  0.969800  0.648097
3     0.218335  0.516788  0.341376  0.654191  0.171033
4    0.0771333  0.465228  0.609761  0.777708  0.218406
..         ...       ...       ...       ...       ...
325    0.34083  0.045743  0.601999  0.280884  0.807816
326   0.988932  0.159610  0.837567  0.396409  0.314547
327   0.740892  0.988692  0.590287  0.611523  0.524868
328   0.406848  0.559085  0.173811  0.790897  0.588132
329   0.977689  0.608806  0.418457  0.641351  0.643052

[330 rows x 5 columns]

In [81]:
newDf.sort_index(axis=0, ascending=False)

             0         1         2         3         4
329   0.977689  0.608806  0.418457  0.641351  0.643052
328   0.406848  0.559085  0.173811  0.790897  0.588132
327   0.740892  0.988692  0.590287  0.611523  0.524868
326   0.988932  0.159610  0.837567  0.396409  0.314547
325    0.34083  0.045743  0.601999  0.280884  0.807816
..         ...       ...       ...       ...       ...
4    0.0771333  0.465228  0.609761  0.777708  0.218406
3     0.218335  0.516788  0.341376  0.654191  0.171033
2    0.0386159  0.600151  0.071985  0.969800  0.648097
1      0.21902  0.279671  0.315153  0.537852  0.522993
0          0.3  0.584004  0.641638  0.590761  0.827202

[330 rows x 5 columns]

In [82]:
newDf.sort_index(axis=1)

             0         1         2         3         4
0          0.3  0.584004  0.641638  0.590761  0.827202
1      0.21902  0.279671  0.315153  0.537852  0.522993
2    0.0386159  0.600151  0.071985  0.969800  0.648097
3     0.218335  0.516788  0.341376  0.654191  0.171033
4    0.0771333  0.465228  0.609761  0.777708  0.218406
..         ...       ...       ...       ...       ...
325    0.34083  0.045743  0.601999  0.280884  0.807816
326   0.988932  0.159610  0.837567  0.396409  0.314547
327   0.740892  0.988692  0.590287  0.611523  0.524868
328   0.406848  0.559085  0.173811  0.790897  0.588132
329   0.977689  0.608806  0.418457  0.641351  0.643052

[330 rows x 5 columns]

In [83]:
newDf.sort_index(axis=1, ascending=False)

            4         3         2         1          0
0    0.827202  0.590761  0.641638  0.584004        0.3
1    0.522993  0.537852  0.315153  0.279671    0.21902
2    0.648097  0.969800  0.071985  0.600151  0.0386159
3    0.171033  0.654191  0.341376  0.516788   0.218335
4    0.218406  0.777708  0.609761  0.465228  0.0771333
..        ...       ...       ...       ...        ...
325  0.807816  0.280884  0.601999  0.045743    0.34083
326  0.314547  0.396409  0.837567  0.159610   0.988932
327  0.524868  0.611523  0.590287  0.988692   0.740892
328  0.588132  0.790897  0.173811  0.559085   0.406848
329  0.643052  0.641351  0.418457  0.608806   0.977689

[330 rows x 5 columns]

In [84]:
newDf.head()

           0         1         2         3         4
0        0.3  0.584004  0.641638  0.590761  0.827202
1    0.21902  0.279671  0.315153  0.537852  0.522993
2  0.0386159  0.600151  0.071985  0.969800  0.648097
3   0.218335  0.516788  0.341376  0.654191  0.171033
4  0.0771333  0.465228  0.609761  0.777708  0.218406

In [85]:
newDf[0][1]

0.21901996818307434

In [86]:
type(newDf[0])

pandas.core.series.Series

In [87]:
newDf

             0         1         2         3         4
0          0.3  0.584004  0.641638  0.590761  0.827202
1      0.21902  0.279671  0.315153  0.537852  0.522993
2    0.0386159  0.600151  0.071985  0.969800  0.648097
3     0.218335  0.516788  0.341376  0.654191  0.171033
4    0.0771333  0.465228  0.609761  0.777708  0.218406
..         ...       ...       ...       ...       ...
325    0.34083  0.045743  0.601999  0.280884  0.807816
326   0.988932  0.159610  0.837567  0.396409  0.314547
327   0.740892  0.988692  0.590287  0.611523  0.524868
328   0.406848  0.559085  0.173811  0.790897  0.588132
329   0.977689  0.608806  0.418457  0.641351  0.643052

[330 rows x 5 columns]

## view

In [88]:
newDfView=newDf

In [89]:
newDfView

             0         1         2         3         4
0          0.3  0.584004  0.641638  0.590761  0.827202
1      0.21902  0.279671  0.315153  0.537852  0.522993
2    0.0386159  0.600151  0.071985  0.969800  0.648097
3     0.218335  0.516788  0.341376  0.654191  0.171033
4    0.0771333  0.465228  0.609761  0.777708  0.218406
..         ...       ...       ...       ...       ...
325    0.34083  0.045743  0.601999  0.280884  0.807816
326   0.988932  0.159610  0.837567  0.396409  0.314547
327   0.740892  0.988692  0.590287  0.611523  0.524868
328   0.406848  0.559085  0.173811  0.790897  0.588132
329   0.977689  0.608806  0.418457  0.641351  0.643052

[330 rows x 5 columns]

In [90]:
newDfView[0][0]=765

C:\Users\Amazon Hub\anaconda3\envs\haseeb\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [91]:
newDf.head()

           0         1         2         3         4
0        765  0.584004  0.641638  0.590761  0.827202
1    0.21902  0.279671  0.315153  0.537852  0.522993
2  0.0386159  0.600151  0.071985  0.969800  0.648097
3   0.218335  0.516788  0.341376  0.654191  0.171033
4  0.0771333  0.465228  0.609761  0.777708  0.218406

In [92]:
newDfView.head()

           0         1         2         3         4
0        765  0.584004  0.641638  0.590761  0.827202
1    0.21902  0.279671  0.315153  0.537852  0.522993
2  0.0386159  0.600151  0.071985  0.969800  0.648097
3   0.218335  0.516788  0.341376  0.654191  0.171033
4  0.0771333  0.465228  0.609761  0.777708  0.218406

In [93]:
newDfCopy=newDf.copy()

In [94]:
newDfCopy[0][0]=656

C:\Users\Amazon Hub\anaconda3\envs\haseeb\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [95]:
newDf.head()

           0         1         2         3         4
0        765  0.584004  0.641638  0.590761  0.827202
1    0.21902  0.279671  0.315153  0.537852  0.522993
2  0.0386159  0.600151  0.071985  0.969800  0.648097
3   0.218335  0.516788  0.341376  0.654191  0.171033
4  0.0771333  0.465228  0.609761  0.777708  0.218406

In [96]:
newDfCopy.head()

           0         1         2         3         4
0        656  0.584004  0.641638  0.590761  0.827202
1    0.21902  0.279671  0.315153  0.537852  0.522993
2  0.0386159  0.600151  0.071985  0.969800  0.648097
3   0.218335  0.516788  0.341376  0.654191  0.171033
4  0.0771333  0.465228  0.609761  0.777708  0.218406

## loc

In [97]:
newDf.head(2)

         0         1         2         3         4
0      765  0.584004  0.641638  0.590761  0.827202
1  0.21902  0.279671  0.315153  0.537852  0.522993

In [98]:
newDf.loc[0,0]

765

In [99]:
newDf.loc[0,0]=5678

In [100]:
newDf.head(2)

         0         1         2         3         4
0     5678  0.584004  0.641638  0.590761  0.827202
1  0.21902  0.279671  0.315153  0.537852  0.522993

In [101]:
newDf.loc[0,4]

0.8272023875257263

In [102]:
newDf.loc[325,1]

0.045742738563160135

In [103]:
newDf.loc[0,0]=9875

In [104]:
newDf.head(2)

         0         1         2         3         4
0     9875  0.584004  0.641638  0.590761  0.827202
1  0.21902  0.279671  0.315153  0.537852  0.522993

In [105]:
newDf.columns=list("ABCDE")

In [106]:
newDf.head(3)

           A         B         C         D         E
0       9875  0.584004  0.641638  0.590761  0.827202
1    0.21902  0.279671  0.315153  0.537852  0.522993
2  0.0386159  0.600151  0.071985  0.969800  0.648097

In [107]:
newDf.loc[0, "A"]

9875

In [108]:
newDf.loc[0,"A"]=65

In [109]:
newDf.head(3)

           A         B         C         D         E
0         65  0.584004  0.641638  0.590761  0.827202
1    0.21902  0.279671  0.315153  0.537852  0.522993
2  0.0386159  0.600151  0.071985  0.969800  0.648097

In [110]:
newDf.loc[35,"A"]

0.442801137983168

In [111]:
newDf.drop(0, axis=0).head(3)

           A         B         C         D         E
1    0.21902  0.279671  0.315153  0.537852  0.522993
2  0.0386159  0.600151  0.071985  0.969800  0.648097
3   0.218335  0.516788  0.341376  0.654191  0.171033

In [112]:
newDf.drop("A", axis=1).head(3)

          B         C         D         E
0  0.584004  0.641638  0.590761  0.827202
1  0.279671  0.315153  0.537852  0.522993
2  0.600151  0.071985  0.969800  0.648097

In [113]:
newDf.head(3)

           A         B         C         D         E
0         65  0.584004  0.641638  0.590761  0.827202
1    0.21902  0.279671  0.315153  0.537852  0.522993
2  0.0386159  0.600151  0.071985  0.969800  0.648097

In [114]:
newDf = newDf.drop("A", axis=1)

In [115]:
newDf.head(3)

          B         C         D         E
0  0.584004  0.641638  0.590761  0.827202
1  0.279671  0.315153  0.537852  0.522993
2  0.600151  0.071985  0.969800  0.648097

In [116]:
newDf.loc[[1,2],["C","D"]]

          C         D
1  0.315153  0.537852
2  0.071985  0.969800

In [117]:
newDf.head(3)

          B         C         D         E
0  0.584004  0.641638  0.590761  0.827202
1  0.279671  0.315153  0.537852  0.522993
2  0.600151  0.071985  0.969800  0.648097

In [118]:
newDf.loc[:,["C","D"]]

            C         D
0    0.641638  0.590761
1    0.315153  0.537852
2    0.071985  0.969800
3    0.341376  0.654191
4    0.609761  0.777708
..        ...       ...
325  0.601999  0.280884
326  0.837567  0.396409
327  0.590287  0.611523
328  0.173811  0.790897
329  0.418457  0.641351

[330 rows x 2 columns]

In [119]:
newDf.loc[[1,2],:]

          B         C         D         E
1  0.279671  0.315153  0.537852  0.522993
2  0.600151  0.071985  0.969800  0.648097

In [120]:
newDf.loc[:5,["C","D"]]

          C         D
0  0.641638  0.590761
1  0.315153  0.537852
2  0.071985  0.969800
3  0.341376  0.654191
4  0.609761  0.777708
5  0.476334  0.851669

In [121]:
newDf.loc[[1,2],:"D"]

          B         C         D
1  0.279671  0.315153  0.537852
2  0.600151  0.071985  0.969800

In [122]:
newDf.loc[(newDf["B"]<0.3)]

            B         C         D         E
1    0.279671  0.315153  0.537852  0.522993
12   0.042747  0.763475  0.586176  0.435506
13   0.257240  0.988563  0.785409  0.170638
17   0.249168  0.141137  0.782501  0.047726
24   0.092861  0.056766  0.069848  0.395166
..        ...       ...       ...       ...
312  0.025225  0.756786  0.904126  0.244455
313  0.171005  0.508942  0.968892  0.991539
318  0.163847  0.091555  0.846440  0.170687
325  0.045743  0.601999  0.280884  0.807816
326  0.159610  0.837567  0.396409  0.314547

[92 rows x 4 columns]

In [123]:
newDf.loc[(newDf["B"]<0.3) & (newDf["D"]>0.2)]

            B         C         D         E
1    0.279671  0.315153  0.537852  0.522993
12   0.042747  0.763475  0.586176  0.435506
13   0.257240  0.988563  0.785409  0.170638
17   0.249168  0.141137  0.782501  0.047726
25   0.178058  0.233705  0.317195  0.466098
..        ...       ...       ...       ...
312  0.025225  0.756786  0.904126  0.244455
313  0.171005  0.508942  0.968892  0.991539
318  0.163847  0.091555  0.846440  0.170687
325  0.045743  0.601999  0.280884  0.807816
326  0.159610  0.837567  0.396409  0.314547

[75 rows x 4 columns]

In [124]:
newDf.head(3)

          B         C         D         E
0  0.584004  0.641638  0.590761  0.827202
1  0.279671  0.315153  0.537852  0.522993
2  0.600151  0.071985  0.969800  0.648097

## iloc

In [125]:
newDf.iloc[0,0]

0.5840042692072244

In [126]:
newDf.iloc[0,0]=555

In [127]:
newDf.head()

            B         C         D         E
0  555.000000  0.641638  0.590761  0.827202
1    0.279671  0.315153  0.537852  0.522993
2    0.600151  0.071985  0.969800  0.648097
3    0.516788  0.341376  0.654191  0.171033
4    0.465228  0.609761  0.777708  0.218406

In [128]:
newDf.iloc[[0,4],[1,3]]

          C         E
0  0.641638  0.827202
4  0.609761  0.218406

In [129]:
newDf.head(4)

            B         C         D         E
0  555.000000  0.641638  0.590761  0.827202
1    0.279671  0.315153  0.537852  0.522993
2    0.600151  0.071985  0.969800  0.648097
3    0.516788  0.341376  0.654191  0.171033

In [130]:
newDf.drop(0).head()

          B         C         D         E
1  0.279671  0.315153  0.537852  0.522993
2  0.600151  0.071985  0.969800  0.648097
3  0.516788  0.341376  0.654191  0.171033
4  0.465228  0.609761  0.777708  0.218406
5  0.824672  0.476334  0.851669  0.474287

In [131]:
# newDf.drop(0, axis=1)

In [132]:
# newDf.drop("B", axis=1).head()

In [133]:
newDf.drop(["C", "D"], axis=1).head()

            B         E
0  555.000000  0.827202
1    0.279671  0.522993
2    0.600151  0.648097
3    0.516788  0.171033
4    0.465228  0.218406

In [134]:
newDf.head()

            B         C         D         E
0  555.000000  0.641638  0.590761  0.827202
1    0.279671  0.315153  0.537852  0.522993
2    0.600151  0.071985  0.969800  0.648097
3    0.516788  0.341376  0.654191  0.171033
4    0.465228  0.609761  0.777708  0.218406

In [135]:
newDf.drop(['B', 'D'], axis=1, inplace=True)

In [136]:
newDf.head()

          C         E
0  0.641638  0.827202
1  0.315153  0.522993
2  0.071985  0.648097
3  0.341376  0.171033
4  0.609761  0.218406

In [137]:
newDf.reset_index().head()

   index         C         E
0      0  0.641638  0.827202
1      1  0.315153  0.522993
2      2  0.071985  0.648097
3      3  0.341376  0.171033
4      4  0.609761  0.218406

In [138]:
newDf.reset_index(drop=True).head()

          C         E
0  0.641638  0.827202
1  0.315153  0.522993
2  0.071985  0.648097
3  0.341376  0.171033
4  0.609761  0.218406

In [139]:
newDf.head()

          C         E
0  0.641638  0.827202
1  0.315153  0.522993
2  0.071985  0.648097
3  0.341376  0.171033
4  0.609761  0.218406

In [140]:
newDf.reset_index(drop=True, inplace=True)

In [141]:
newDf.head()

          C         E
0  0.641638  0.827202
1  0.315153  0.522993
2  0.071985  0.648097
3  0.341376  0.171033
4  0.609761  0.218406

# Groupby
The groupby method allows you to group rows of data together and call aggregate functions

â€‹
â€‹

In [142]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [143]:
df = pd.DataFrame(data)

In [144]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

### Now you can use the .groupby() method to group rows together based off of a column name.
For instance let's group based off of Company. This will create a DataFrameGroupBy object:

In [145]:
df.groupby('Company')

##### You can save this object as a new variable:

In [146]:
by_comp = df.groupby("Company")
type(by_comp)

pandas.core.groupby.generic.DataFrameGroupBy

#### And then call aggregate methods of the object:

In [147]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [148]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [149]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [150]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [151]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [152]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [153]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0